controllers/CustomersController.php

    public function actionIndex()
    {
        //echo "in index";

        $model = new Customers();

        $id = Yii::$app->getRequest()->getQueryParam('id');

        if($id){
            $model = $this->findModel($id);

            if ($model->load(Yii::$app->request->post()) && $model->save()) {
                //return $this->redirect(['view', 'id' => $model->id]);
                $model = new Customers();
                return $this->redirect(['index']);

            }

        }else{
            if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
UPDATE `customers` SET `name`='Afsa', `email`='ADa@vew.com', `phone_number`='1231232132' WHERE `id`=51
INSERT INTO `customers` (`name`, `email`, `phone_number`) VALUES ('hasgdjh', 'agds@hgfhs.com', '1233132142')

    protected function findModel($id)
    {
        if (($model = Customers::findOne($id)) !== null) {
---
SELECT * FROM `customers` WHERE `id`='1'